<? include "head.php"; ?>
<? include "header.php"; ?>
<body>
    <!-- Основной контент -->
    <main>
        <h1>Часто задаваемые вопросы</h1>

        <div class="faq-section">
            <div class="faq-item">
                <h3>Как внести замену?</h3>
                <p>Для внесения замены перейдите на страницу "Внесение замен" и заполните форму. После заполнения нажмите кнопку "Добавить замену".</p>
            </div>

            <div class="faq-item">
                <h3>Как удалить замену?</h3>
                <p>Для удаления замены найдите её в таблице на странице "Просмотр замен" и нажмите на иконку корзины. В выпавшем окне, подтвердите ваше действие.</p>
            </div>

            <div class="faq-item">
                <h3>Как отфильтровать замены?</h3>
                <p>На странице "Просмотр замен" вы можете использовать фильтры для поиска замен по дате, группе, типу замены, преподавателю, дисциплине и номеру пары.</p>
            </div>

            <div class="faq-item">
                <h3>Как связаться с поддержкой?</h3>
                <p>Вы можете связаться с разработчиком в по контактным данным, указанным в нижней части страницы.</p>
            </div>
        </div>
    </main>
</body>
<? include "footer.php"; ?>